#include<stdio.h>
int main(void){
	int a[10]={4,14,3,35,43,23,56,34,27,18};
	int x=6;
	int *p=a,*q=&x;
//		*p=a默认*p=a[0];		但不能*p=a[1]!!!只能是*p=&a[1]!!! 
	printf("p=%d\t q=%d\n",p,q); 
	printf("*p=%d\t *q=%d\n",*p,*q);
	//加*号与不加*号是不一样的！！！ 

	printf("p[0]=%d\t q[0]=%d\n",p[0],q[0]);
//	printf("*p[0]=%d *q[0]=%d\n",*p[0],*q[0]);数组不能加*号，会报错！！！ 
//			由此可得*p==*p[0],*q==*q[0]！！！ 

	printf("p=%p\t q=%p\n",p,q);
//			不加*号与加上*号地址不一样 
	printf("*p=%p\t *q=%p\n",*p,*q);
	//加*号与不加*号是不一样的！！！ 
	
	printf("p[0]=%p\t q[0]=%p\n",p[0],q[0]);
//	printf("*p[0]=%p *q[0]=%p\n",*p[0],*q[0]);数组不能加*号，会报错！！！
//			由此可得*p与p[0]的地址一样,*q与q[0]地址一样！！！ 

	printf("a=%d\t *a=%d\n",a,*a);
//		a与*a不一样，默认*a为a[0]!!! 
	printf("a=%p\t *a=%p\n",a,*a);//a与*a地址也不一样！！！
	printf("&a=%p\n",&a);
//		&a输出的地址与a的一样但类型不一样
//		&a的类型是 int(*)[10](指向包含10个int的数组的指针)
//		a的内心是int*(指向int的指针) 
	printf("a[1]=%p\t &a[1]=%p\n",a[1],&a[1]); 
//		a[1]与&a[1]的地址也不一样！！！
// 		a[1]是一个数组元素“值 ”的地址 
//		而&a[1]是一个数组元素的地址
//a[1]是内容  &a[1]却是地址 

	return 0; 
} 
